
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.prow_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run Prow application in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;gcr.io/k8s-prow/analyze\&#34;\n      - \&#34;gcr.io/k8s-prow/crier\&#34;\n      - \&#34;gcr.io/k8s-prow/deck\&#34;\n      - \&#34;gcr.io/k8s-prow/ghproxy\&#34;\n      - \&#34;gcr.io/k8s-prow/hook\&#34;\n      - \&#34;gcr.io/k8s-prow/horologium\&#34;\n      - \&#34;gcr.io/k8s-prow/pipeline\&#34;\n      - \&#34;gcr.io/k8s-prow/prow-controller-manager\&#34;\n      - \&#34;gcr.io/k8s-prow/sinker\&#34;\n      - \&#34;gcr.io/k8s-prow/status-reconciler\&#34;\n      - \&#34;gcr.io/k8s-prow/tide\&#34;\n      - \&#34;k8s.gcr.io/gcsweb\&#34;\n      - \&#34;docker.io/nginx\&#34;\n      - \&#34;docker.io/prom/pushgateway\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.prow_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n      - \&#34;prow-monitoring\&#34;\n      - \&#34;probot-stale\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;openpolicyagent/gatekeeper\&#34;\n      - \&#34;docker.io/grafana/grafana\&#34;\n      - \&#34;docker.io/nginx\&#34;\n      - \&#34;quay.io/prometheus-operator/prometheus-config-reloader\&#34;\n      - \&#34;quay.io/prometheus-operator/prometheus-operator\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/ghproxy\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/ghproxy\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
* Delete
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;docker.io/openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;docker.io/openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run Prow application in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"gcr.io/k8s-prow/analyze\"\n      - \"gcr.io/k8s-prow/crier\"\n      - \"gcr.io/k8s-prow/deck\"\n      - \"gcr.io/k8s-prow/ghproxy\"\n      - \"gcr.io/k8s-prow/hook\"\n      - \"gcr.io/k8s-prow/horologium\"\n      - \"gcr.io/k8s-prow/pipeline\"\n      - \"gcr.io/k8s-prow/prow-controller-manager\"\n      - \"gcr.io/k8s-prow/sinker\"\n      - \"gcr.io/k8s-prow/status-reconciler\"\n      - \"gcr.io/k8s-prow/tide\"\n      - \"k8s.gcr.io/gcsweb\"\n      - \"docker.io/nginx\"\n      - \"docker.io/prom/pushgateway\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - gcr.io/k8s-prow/analyze
                - gcr.io/k8s-prow/crier
                - gcr.io/k8s-prow/deck
                - gcr.io/k8s-prow/ghproxy
                - gcr.io/k8s-prow/hook
                - gcr.io/k8s-prow/horologium
                - gcr.io/k8s-prow/pipeline
                - gcr.io/k8s-prow/prow-controller-manager
                - gcr.io/k8s-prow/sinker
                - gcr.io/k8s-prow/status-reconciler
                - gcr.io/k8s-prow/tide
                - k8s.gcr.io/gcsweb
                - docker.io/nginx
                - docker.io/prom/pushgateway
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n      - \"prow-monitoring\"\n      - \"probot-stale\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"docker.io/grafana/grafana\"\n      - \"docker.io/nginx\"\n      - \"quay.io/prometheus-operator/prometheus-config-reloader\"\n      - \"quay.io/prometheus-operator/prometheus-operator\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
                - prow-monitoring
                - probot-stale
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - openpolicyagent/gatekeeper
                - docker.io/grafana/grafana
                - docker.io/nginx
                - quay.io/prometheus-operator/prometheus-config-reloader
                - quay.io/prometheus-operator/prometheus-operator
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be destroyed
  # (because key ["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-tools-namespaces" -> null
      - kind                    = "K8sAllowedImages" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "e8301a55-e6e2-4f04-9237-6907306e8c82" -> null
      - name                    = "prow-tools-namespaces" -> null
      - server_side_apply       = false -> null
      - uid                     = "e8301a55-e6e2-4f04-9237-6907306e8c82" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - docker.io/openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/ghproxy\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-prowjobs-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/ghproxy
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be destroyed
  # (because key ["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-prowjobs-namespace" -> null
      - kind                    = "K8sAllowedImages" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "15cb5575-cc4f-4bab-a9d9-73392dc02a68" -> null
      - name                    = "prow-prowjobs-namespace" -> null
      - server_side_apply       = false -> null
      - uid                     = "15cb5575-cc4f-4bab-a9d9-73392dc02a68" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be destroyed
  # (because key ["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-tools-namespaces" -> null
      - kind                    = "K8sAllowedImages" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "2d4f9372-a169-4832-9f8a-d9b362aec970" -> null
      - name                    = "prow-tools-namespaces" -> null
      - server_side_apply       = false -> null
      - uid                     = "2d4f9372-a169-4832-9f8a-d9b362aec970" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - docker.io/openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/ghproxy\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-prowjobs-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/ghproxy
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be destroyed
  # (because key ["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-prowjobs-namespace" -> null
      - kind                    = "K8sAllowedImages" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "5ae45899-ca99-4831-a85d-37f90162ac3d" -> null
      - name                    = "prow-prowjobs-namespace" -> null
      - server_side_apply       = false -> null
      - uid                     = "5ae45899-ca99-4831-a85d-37f90162ac3d" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

Plan: 6 to add, 0 to change, 4 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 35, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  35: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7980,"Program":"tfcmt","SHA1":"a8e0feae8d53161e30054b21bf87dc2ccc5b39c9","Vars":{}} -->